Revit 2026 API

# GlobalParametersManager Properties

---

The GlobalParametersManager type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

GlobalParametersManager Class

Autodesk.Revit.DB Namespace